Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Returns the maximum element in an asynchronous sequence of comparable elements.
ja: 比較可能要素それらからなるある非同期シーケンスの中の最大の要素を返します。

source: Returns the maximum element in the asynchronous sequence, using the given predicate as the comparison between elements.
ja: 非同期シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence.
ja: シーケンスの中の最大の要素を返します。

source: Returns the minimum element in an asynchronous sequence of comparable elements.
ja: 比較可能要素それらからなるある非同期シーケンスの中の最小の要素を返します。

source: Returns the minimum element in the asynchronous sequence, using the given predicate as the comparison between elements.
ja: 非同期シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence.
ja: シーケンスの中の最小の要素を返します。

source: Returns the next consecutive location after i.
ja: iの後の、以降に続く場所を返します。

source: Returns the next consecutive position after i.
ja: iの後の、以降に続く位置を返します。

source: Returns the non-nil results of mapping the given transformation over this sequence.
ja: 与えられた変換をこのシーケンス全体にわたってマッピングする非nilの結果を返します。

source: Returns the number of UTF-16 code units required for the given code unit sequence when transcoded to UTF-16, and a Boolean value indicating whether the sequence was found to contain only ASCII characters.
ja: UTF-16にコード変換するときに指定されたコードユニットシーケンスに必要とされるUTF-16コードユニットの数を、およびそのシーケンスがASCII文字だけを含むことを発見されたかどうかを指し示すブール値を、返します。

source: Returns the number of code units required to encode the given Unicode scalar.
ja: 与えられたユニコードスカラーをエンコードするのに必要とされるコードユニットの数を返します。

source: Returns the position immediately after the given index.
ja: 与えられたインデックスの直後の位置を返します。

source: Returns the position immediately before the given index.
ja: 与えられたインデックスの直前の位置を返します。

source: Returns the position in the given UTF-16 view that corresponds exactly to this index.
ja: 与えられたUTF-16ビューの中のある位置を返します、それは正確にこのインデックスに対応します。

source: Returns the position in the given UTF-8 view that corresponds exactly to this index.
ja: 与えられたUTF-8ビューの中のある位置を返します、それは正確にこのインデックスに対応します。

source: Returns the position in the given string that corresponds exactly to this index.
ja: 与えられた文字列の中のある位置を返します、それは正確にこのインデックスに対応します。

source: Returns the position in the given view of Unicode scalars that corresponds exactly to this index.
ja: 与えられたユニコードスカラーのビューの中のある位置を返します、それは正確にこのインデックスに対応します。

source: Returns the previous consecutive location before i.
ja: i前の、以前に続く場所を返します。

source: Returns the product of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の積を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the product of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の積、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient and remainder of this value divided by the given value.
ja: 与えられた値で除算されたこの値の商と余りを返します。

source: Returns the quotient obtained by dividing this value by the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値を指定の値で割ることで入手される商、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した商を返します。

source: Returns the remainder after dividing this value by the given value, along with a Boolean value indicating whether overflow occurred during division.
ja: この値を指定の値によって除算する後の余り、それに加えてオーバーフローが除算の間に起こったかどうかを示すブール値を返します。

source: Returns the remainder of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した余りを返します。

source: Returns the result of combining the elements of the asynchronous sequence using the given closure, given a mutable initial value.
ja: 非同期シーケンスの要素をこの与えられたクロージャを使って結合する結果を返します、ある可変の初期値を与えられます。

source: Returns the result of combining the elements of the asynchronous sequence using the given closure.
ja: 非同期シーケンスの要素をこの与えられたクロージャを使って結合する結果を返します。

source: Returns the result of combining the elements of the sequence using the given closure.
ja: 与えられたクロージャを使って、このシーケンスの要素それらを結合する結果を返します。

source: Returns the result of performing a bitwise AND operation on the two given values.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise OR operation on the two given values.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise XOR operation on the two given values.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をマスクしてその型のもつビット幅にしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します。

source: Returns the sum of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の合計を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the sum of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の合計、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the underlying string from which this Substring was derived.
ja: それからこの下位文字列が引き出された基礎をなす文字列を返します。

source: Returns whether the given code unit represents an ASCII scalar
ja: 与えられたコード単位が、あるASCIIスカラーを表すかどうかを返します。

source: Returns whether this string is capable of providing access to validly-encoded UTF-8 contents in contiguous memory in O(1) time.
ja: この文字列が、有効に符号化されたUTF-8内容に隣接メモリにおいて O(1) 時間でアクセスを提供する能力があるかどうかを返します。

source: Returns without performing work if self and source are equal.
ja: selfとsourceが等しいならば、作業を実行することなしに戻ります。

source: Reverses the elements of the collection in place.
ja: コレクションの要素をその場で逆順にします。

source: Right bit shift and assign
ja: 右ビットシフトして代入する

source: Right bit shift ignoring overflow and assign
ja: 右ビットシフト、オーバーフローを無視します、そして割り当てます

source: Right shift operations on negative values “fill in” the high bits with ones instead of zeros.
ja: 負値上での右シフト演算は、高ビットを１で「満たします」、ゼロではなく。

source: Run given operation as asynchronously in its own top-level task.
ja: 与えられたoperationを非同期なものとしてそれ自身のトップレベルタスクにおいて実行します。

source: Run given throwing operation as part of a new top-level task.
ja: 与えられたスローするoperationを新しいトップレベルタスクの一部として実行します。

source: Runs body over the content of this string in contiguous memory.
ja: bodyを、隣接メモリの中のこの文字列の内容に対して実行します。

source: Runs body over the content of this substring in contiguous memory.
ja: bodyを、隣接メモリの中のこの下位文字列の内容に対して実行します。

source: SIMD Implementations
ja: SIMD実装

source: SIMD Vector Types
ja: SIMDベクター型

source: SIMD Vectors
ja: SIMDベクター

source: SIMDStorage Implementations
ja: SIMDStorage実装

source: Scalar values representing characters that are normally unprintable or that otherwise require escaping are escaped with a backslash.
ja: 通常は出力できないまたはそうするにはエスケープする必要がある、スカラー値表現の文字は、バックスラッシュでエスケープされます。

source: Scalars are never removed from the Unicode Standard, but the usage of deprecated scalars is strongly discouraged.
ja: スカラーは決して「ユニコード標準」から取り除かれません、しかし非推奨のスカラーの使用は強く反対されます。

source: Scalars for which this property is true are frequently, but not always, combining marks or modifiers.
ja: それに対してこのプロパティがtrueであるスカラーはしばしば、しかし常にではなく、符号または修飾子と組み合わさっています。

source: Scalars that have default to emoji presentation can be followed by U+FE0E VARIATION SELECTOR-15 to request the text presentation of the scalar instead.
ja: emoji表現が初期状態であるスカラーは、U+FE0E VARIATION SELECTOR-15が後に続くことで、そのスカラーのテキスト表現を代わりに要請できます。

source: Scalars with a non-nil numeric type include numbers, fractions, numeric superscripts and subscripts, and circled or otherwise decorated number glyphs.
ja: 非nilの数値型をもつスカラーは、数字、分数、上付きおよび下付き数字、そして丸またはそれ以外に装飾された数の字体を含みます。

source: Scalars with this numeric type are often those that represent a decimal digit but would not typically be used to write a base-10 number, such as “④” (U+2463 CIRCLED DIGIT FOUR).
ja: この数値型を持つスカラーは、たいてい10進法桁を表すがしかし概して底10の数を記述するのに使われないものです、例えば “④”（U+2463 CIRCLED DIGIT FOUR）など。

source: Scroll to the Coffee Tracker complication, and then click the Digital Crown again to save your changes.
ja: Coffee Trackerコンプリケーションまでスクロールしてください、そしてそれからDigital Crownを再びクリックしてあなたの変更を保存してください。

source: See also: elements
ja: 参照：elements

source: Select the complication to modify.
ja: 修正するためにコンプリケーションを選択します。

source: Sequence and Collection Protocols
ja: シーケンスおよびコレクションプロトコル

source: Serialize and deserialize instances of your types with implicit or customized encoding.
ja: あなたの型のインスタンスを暗黙のまたはカスタマイズされたエンコーディングでシリアライズおよびデシリアライズします。

source: Sets
ja: 集合

source: Sets and Dictionaries
ja: 集合と辞書

source: Several methods on the CLKComplicationDataSource protocol used to configure the app’s timeline take completion handlers, which you can replace with their async equivalents:
ja: アプリのもつタイムラインを構成設定するために使われるCLKComplicationDataSourceプロトコル上のいくつかのメソッドは、完了ハンドラをとります、それはあなたがそれらのasync相当物と置き換え可能です：

source: Shuffles the collection in place, using the given generator as a source for randomness.
ja: コレクションをその場で混ぜ合わせます、与えられた生成子を無作為さの出典として使います。

source: Shuffles the collection in place.
ja: コレクションをその場で混ぜ合わせます。

source: Signed Integers
ja: 符号付き整数

source: Since there is no key for 4, the closure returns nil in this case, which compactMap(_:) omits from the transformed asynchronous sequence.
ja: 4に対するキーがないことから、クロージャはnilをその場合には返します、それはcompactMap(_:)がこの変換されたシーケンスから省きます。

source: Slices
ja: スライス

source: Slices Inherit Semantics
ja: スライスは意味論を継承します

source: Slices Share Indices
ja: スライスはインデックスを共有します

source: Slicing with an unbounded range is essentially a conversion of a collection instance into its slice type.
ja: 無境界範囲でスライスすることは、本質的にあるコレクションインスタンスのそれのスライス型への変換です。

source: Solve complex problems and write high-performance, readable code.
ja: 複雑な問題を解決します、そして高性能の、読みやすいコードを記述します。

source: Some Objective-C APIs—like target-action—accept method or property names as parameters, then use those names to dynamically call or access the methods or properties.
ja: いくつかのObjective-C API — ターゲットアクションのような — は、メソッドまたはプロパティ名を引数として受け入れます、そのときそれらの名前を使って動的にメソッドまたはプロパティに呼び出しまたはアクセスをします。

source: Some characters that are visible in a string are made up of more than one Unicode scalar value.
ja: 文字列の中に見られるいくつかの文字は、１つ以上のユニコードスカラー値で構成されます。

source: Some letterlike scalars used in numeric systems, such as Greek or Latin letters, do not have a non-nil numeric type, in order to prevent programs from incorrectly interpreting them as numbers in non-numeric contexts.
ja: 数値システムにおいて使われるいくつかの字のようなスカラー、例えばギリシャまたはラテン文字それらは、非nilの数値型を持ちません、その目的はプログラムが非数値文脈においてそれらを間違って数として解釈するのを防ぐことです。

source: Some scalars, such as control characters, do not have a value for this property in the Unicode Character Database.
ja: いくつかのスカラー、例えば制御文字などは、このプロパティに対する値を「ユニコード文字データベース」において持ちません。

source: Sorting these scalars by their combining classes yields "\u{0041}\u{0316}\u{0301}", so two strings that differ only by the ordering of those scalars would compare as equal:
ja: これらのスカラーをそれらの結合クラスによってソートすることは、"\u{0041}\u{0316}\u{0301}"を生み出します、それでこれらのスカラーの順番によってのみ異なる２つの文字列は等しいと比較されます：

source: Sorts the collection in place, using the given predicate as the comparison between elements.
ja: コレクションをその場でソートします、与えられた述部を要素間の比較として使います。

source: Sorts the collection in place.
ja: コレクションをその場でソートします。

source: Spawn, unconditionally, a child task in the group.
ja: ある子タスクをこのグループの中に、無条件に、生み出します。

source: Special-Use Collections
ja: 特殊用途のコレクション

source: Special-Use Numeric Types
ja: 特殊用途の数値型

source: Specifically, dropping a detached tasks Task does not automatically cancel given task.
ja: とりわけ、分離されたタスクTaskを放り出すことは、与えられたタスクを自動的に取り消しません。

source: Specifically, dropping a detached tasks Task.Handle does not automatically cancel given task.
ja: とりわけ、分離されたタスクTask.Handleを放り出すことは、与えられたタスクを自動的に取り消しません。

source: Specifically, it does not validate that a high-surrogate code unit precedes x.
ja: 具体的には、それは高位サロゲートコード単位がxの前にくることを検証しません。

source: Specifically, it does not validate that a low-surrogate code unit follows x.
ja: 具体的には、それは低位サロゲートコード単位がxの後にくることを検証しません。

source: Specifically, scalars have this numeric type if they occupy a contiguous range of code points representing numeric values 0...9.
ja: 具体的に、スカラーは、もしそれらが数値0...9を表しているコード点の隣接範囲を占有するならば、この数値型を持ちます。

source: Splitting a String
ja: 文字列を分割する

source: Standard Library
ja: 標準ライブラリ

source: Starts a new scope in which a dynamic number of throwing tasks can be created.
ja: 新しいタスクグループを開始します、それにおいて動的な数のスローするタスクが作成されることが可能です。

source: Starts a new task group which provides a scope in which a dynamic number of tasks may be created.
ja: 新しいタスクグループを開始します、それはあるスコープを提供しそれにおいて動的な数のタスクが作成されるかもしれないものです。

source: Starts or continues decoding a UTF-16 sequence.
ja: あるUTF-16シーケンスのデコードを開始または継続します。

source: Starts or continues decoding a UTF-32 sequence.
ja: あるUTF-32シーケンスのデコードを開始または継続します。

source: Starts or continues decoding a UTF-8 sequence.
ja: あるUTF-8シーケンスのデコードを開始または継続します。

source: Starts or continues decoding a code unit sequence into Unicode scalar values.
ja: コード単位シーケンスをユニコードスカラー値へデコードすることを開始するまたは継続します。

source: Storage for a vector of 16 integers.
ja: 16整数のベクターに対するストレージ。

source: Storage for a vector of 32 integers.
ja: 32整数のベクターに対するストレージ。

source: Storage for a vector of 64 integers.
ja: 64整数のベクターに対するストレージ。

source: Storage for a vector of eight integers.
ja: ８整数のベクターに対するストレージ。

source: Storage for a vector of four integers.
ja: 4整数のベクターに対するストレージ。

source: Storage for a vector of two integers.
ja: ２整数のベクターに対するストレージ。

source: Store and organize data using arrays, dictionaries, sets, and other data structures.
ja: 配列、辞書、集合、および他のデータ構造を使ってデータを格納および組織化します。

source: Store your custom types in sets or use them as dictionary keys.
ja: いろいろなあなたのあつらえの型を集合に格納するまたはそれらを辞書キーとして使います。

source: Stores a value’s bytes into the buffer pointer’s raw memory at the specified byte offset.
ja: 値のもつバイトをバッファポインタのもつ生のメモリに指定されたバイトオフセットで格納します。

source: Stores the given value’s bytes into raw memory at the specified offset.
ja: 与えられた値のもつバイトを生のメモリへ指定されたオフセットで格納します。

source: Stores the result of performing a bitwise AND operation on the two given values in the left-hand-side variable.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise OR operation on the two given values in the left-hand-side variable.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise XOR operation on the two given values in the left-hand-side variable.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the left in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the right in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を左手側の変数に格納します。

source: Storing an unsafe task handle doesn’t have an impact on the task’s actual life cycle, and the behavior of accessing an unsafe task handle outside of the withUnsafeCurrentTask(body:) method’s closure isn’t defined.
ja: 非安全タスクハンドルを格納することは、タスクのもつ実際のライフサイクルに影響を与えません、そして非安全タスクハンドルにwithUnsafeCurrentTask(body:)メソッドのもつクロージャの外側でアクセスすることの挙動は、未定義です。

source: Storing substrings may, therefore, prolong the lifetime of string data that is no longer otherwise accessible, which can appear to be memory leakage.
ja: 下位文字列の格納は、したがって、それ以外ではもはやアクセスできない文字列データのライフサイクルを延長するでしょう、それはメモリリークとして現れかねません。

source: Streams
ja: ストリーム

source: Strides
ja: ストライド

source: String Literals
ja: 文字列リテラル

source: String Representation
ja: 文字列表現

source: String buffers use an exponential growth strategy that makes appending to a string a constant time operation when averaged over many append operations.
ja: 文字列バッファは指数成長戦略を使います、それはある文字列へ追加することを、多くの追加演算を平均した時に定数時間演算にします。

source: String interpolations give you an easy way to build a string from multiple pieces.
ja: 文字列補間は、多様な断片からある文字列を組み立てる簡単な方法をあなたに提供します。

source: StringProtocol Implementations
ja: Stringプロトコル実装

source: Strings always have value semantics.
ja: 文字列は常に値意味論を持ちます。

source: Strings and Characters
ja: 文字列と文字

source: Strings and Text
ja: 文字列とテキスト

source: Strings and their views share indices, so you can access the UTF-8 view of the name string using the same firstSpace index.
ja: 文字列とそれのビューはインデックスを共有します、それであなたはname文字列のUTF-8ビューにアクセスすることが同じfirstSpaceインデックスを使って可能です。

source: Strings in Swift are Unicode correct and locale insensitive, and are designed to be efficient.
ja: Swiftでの文字列は、ユニコードに正確でロケールに影響されず、そして効率的であるように設計されます。

source: Strings in Swift conform to the Comparable protocol, so the names are sorted in ascending order according to the less-than operator (<).
ja: 文字列はSwift ではComparableプロトコルに準拠します、それでこれらの名前はより小さい演算子（<）によって昇順にソートされます。

source: Structures
ja: 構造体

source: Subscripts
ja: 添え字

source: Substrings present the same interface as strings.
ja: 下位文字列は、文字列と同じインターフェイスを提供します。

source: Subtract
ja: 減算

source: Subtract and assign
ja: 減算して代入する

source: Subtract with overflow
ja: オーバーフロー減算

source: Subtract with overflow and assign
ja: 減算、オーバーフローと割り当てとともに

source: Subtracts one value from another and produces their difference.
ja: ある値をもう一方から減じて、それらの差を返します。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable, wrapping any overflow.
ja: ２番目の値を最初のものから減じてその差を左手側の変数の中に格納します、あらゆるオーバーフローをラップします。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable.
ja: ２番目の値を最初のものから減じて、その差を左手側の変数の中に格納します。

source: Such letters are stored in text ahead of syllable-initial consonants.
ja: そのような文字は、テキストにおいて音節リテラルの子音の前に格納されます。

source: Such tasks will be created yet immediately cancelled, allowing the tasks to perform some short-cut implementation, if they are responsive to cancellation.
ja: そのようなタスクは作成されるけれども直ぐに取り消されるでしょう、タスクそれらに何らかのショートカット実装を実行させて、もしそれらが取り消しに反応するならば。

source: Supporting Functions
ja: 補助関数

source: Supporting Types
ja: 支援を行う型

source: Suspending Execution
ja: 遂行を一時停止する

source: Suspends the current task and allows other tasks to execute.
ja: 現在のタスクを一時停止して他のタスクに遂行を許可します。

source: Suspends the current task for at least the given duration in nanoseconds, unless the task is cancelled.
ja: 現在のタスクを少なくともこのナノ秒で与えられた期間に対して一時停止します、そのタスクが取り消されない限り。

source: Suspends the current task for at least the given duration in nanoseconds.
ja: 現在のタスクを少なくともこのナノ秒で与えられた期間に対して一時停止します。

source: Suspends the current task, then calls the given closure with a checked continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する検査済み継続で呼び出します。

source: Suspends the current task, then calls the given closure with a checked throwing continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する検査済みスロー継続で呼び出します。

source: Suspends the current task, then calls the given closure with an unsafe continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する安全でない継続で呼び出します。

source: Suspends the current task, then calls the given closure with an unsafe throwing continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する安全でないスロー継続で呼び出します。

source: Swift Standard Library
ja: Swift標準ライブラリ

source: Swift Standard Library Functions
ja: Swift標準ライブラリ関数

source: Swift concurrency provides a standard set of language tools and techniques for concurrent programming.
ja: Swift並行性は、標準的な一揃いの言語ツールと技法を並行性プログラミングのために提供します。

source: Swift converts an expression like "The time is \(time)." as MyString into a series of statements similar to:
ja: Swiftは、"The time is \(time)." as MyStringのような式を、次のような一連の文に変換します：

source: Swift passes this initializer a pair of arguments specifying the size of the literal segments and the number of interpolated segments.
ja: Swiftはこのイニシャライザに、リテラル文節のサイズと補間文節の数を指定する一対の引数を渡します。

source: Swift streamlines interoperation with C string APIs by letting you pass a String instance to a function as an Int8 or UInt8 pointer.
ja: Swiftは、あなたにStringインスタンスを関数へInt8またはUInt8ポインタとして渡させることによって、C文字列APIとの相互作用を能率化します。

source: Swift’s String type conforms to TextOutputStream already, so you can capture the output from print(_:to:) and dump(_:to:) in a string instead of logging it to standard output.
ja: SwiftのString型は、すでにTextOutputStreamに準拠します、なのであなたはprint(_:to:)およびdump(_:to:)からの出力を文字列の中に捕えることが、それを標準出力に記録する代わりに行えます。

source: Swipe left until the configuration screen highlights the complications.
ja: 構成画面がコンプリケーションをハイライト表示するまで、左にスワイプしてください。

source: TODO: Define the details of task priority; It is likely to be a concept similar to Darwin Dispatch’s QoS; bearing in mind that priority is not as much of a thing on other platforms (i.e. server side Linux systems).
ja: すべきこと：タスク優先度の詳細を定義してください；それは Darwin Dispatch の QoS に似た概念になりそうに思われる；優先度は他のプラットホーム（すなわち、サーバーサイドLinuxシステムそれら）上のものと同様でないことに留意する。

source: Tap the Coffee Tracker complication to go back to the app.
ja: Coffee Trackerコンプリケーションをタップしてアプリに戻ってください。

source: Task Cancellation
ja: タスク取り消し

source: Task local values cannot be set directly and must instead be bound using the scoped $traceID.withValue() { ... } operation.
ja: タスクローカル値は、直接にsetされることが出来ません、そして代わりにスコープ付き$traceID.withValue() { ... }演算を使ってバインドされなければなりません。

source: Task local values of optional types default to nil.
ja: オプショナル型のタスクローカル値は、省略時にはnilになります。

source: Task locals must be declared as static properties (or global properties, once property wrappers support these), like this:
ja: タスクローカルそれらは、静的プロパティとして宣言されなければなりません（またはグローバルプロパティ、一旦プロパティラッパーがそれらをサポートするならば）、このように：

source: Task priority may inform decisions an Executor makes about how and when to schedule tasks submitted to it.
ja: タスク優先度は、Executorがそれへと提出されるタスクそれらを、どのようにそしていつ予定するかについてする決定を告知するかもしれません。

source: Task-Local Storage
ja: タスクローカルなストレージ

source: Task-local declarations
ja: タスクローカルな宣言

source: Tasks
ja: さまざまなタスク

source: Tasks include a shared mechanism for indicating cancellation, but not a shared implementation for how to handle cancellation.
ja: タスクは、ある共有された仕組みを取り消しを指し示すために含みます、しかしどのように取り消しを扱うかのための共有された実装ではありません。

source: Ternary conditional
ja: 三項条件

source: Testing
ja: テスト

source: Text Output
ja: テキスト出力

source: That argument list can include multiple arguments and argument labels.
ja: 引数リストは、複数の引数そして引数ラベルを含むことができます。

source: That is, bitPattern % MemoryLayout<Pointee>.alignment must be 0.
ja: すなわち、bitPattern % MemoryLayout<Pointee>.alignmentは、0でなければなりません。

source: That is, for any elements a, b, and c, the following conditions must hold:
ja: すなわち、何らかの要素a、b、そしてcに対して、以下の条件が保持されなければなりません：

source: That is, if source is negative, the result is padded with ones; otherwise, the result is padded with zeros.
ja: すなわち、sourceが負ならば、結果は１で詰め物をされます；そうでなければ、結果はゼロで詰め物をされます。
